converted diagrams to mermaid
